/*
ダングリングポインタ
1. free
2. 関数が終わった時
*/

int *p = malloc(sizeof *p);
*p = 42;
free(p); // p: 댕글링 포인터 (p 안의 주소값 자체는 그대로 남아 있다. free는 p를 바꾸지 않는다.)


// int*를 반환하는 함수
int *bad(void) {
    int x = 10;   // x는 bad의 스택 프레임 안에 생기는 지역 변수
    return &x;   // x의 주소(int*)반환. 함수가 끝나면 x의 스택 프레임이 사라짐 → 반환값은 댕글링
}

int *p = bad(); // bad return시 x가 있던 스택 프레임 무효화. -> p는 사라진 x의 자리 가리킴 (댕글링 포인터)
printf("%d\n", *p); // UB. 다음 함수 호출이 해당 스택 공간을 덮어쓸 수 있다. 

/*
해결책. 
- 함수 밖에서도 살아 있어야하는 데이터 -> malloc으로 힙에 만들어 반환 후 호출자가 free ???
*/

// Java의 경우 지역 변수는 원시값이나 참조만 담고, 지역 변수의 주소를 꺼내는 연산자 X. 객체는 모두 힙에. GC가 참고가 남아있는 한 살려둔다.
// 하지만 C는 &로 스택 변수의 주소를 꺼내올 수 있기 때문에, 주소가 변수보다 오래 살아남는 상황을 개발자가 막아야함

