/*
[문제19] 알파벳을 입력하여 대소문자 바꾸기
키보드로 알파벳을 입력 받은 후 대문자는 소문자로 소문자는 대문자로 바꾸어
출력하시오 만약 입력된 값이 알파벳이 아닌 경우 "알파벳을 입력하시오"라는
문자열을 출력한 후 프로그램을 종료한다.
1) 실행 결과
알파벳 입력 : a
a -> A
알파벳 입력 : B
B -> b
알파벳 입력 : ?
알파벳을 입력하시오

*/

#include <stdio.h>

// A : 65, a : 97
int main(void) {
    // 문자 상수 'a' 와 문자열 리터럴 "a" 항상 구분하기!!!!
    // 리터럴은 수정하면 UB -> 항상 const!!
    const char t = 'a';
    // const char t1 = "a"; /* 불가능 :['a']['\0'] 두 바이트 배열 생성 */
    // const char *t2 = "a";
    const char *t3 = "ab";

    printf("%c\n", t);       /* a : 해당 문자 'a' 읽음 */
    printf("%c\n", *t3);     /* a : 1바이트만 읽음 */
    printf("%c\n", *t3 + 1); /* b : 다음 바이트 */
    printf("%s\n", t3);      /* ab : 주소를 받아 \0을 만날 때까지 출력 */
    printf("%d\n", *t3);     /* 97 : 첫 바이트를 정수로 출력 */

    return 0;
}
