/*
[문제23] 서기 1년부터 현재까지 돼지해 출력하기
연도를 입력 받아 서기 1년~입력 년도 사이의 모든 돼지의 해를 아래와 같이 출력하시오
1) Hint
돼지의 해는 연도를 12로 나누어 나머지가 3인 해이다.
2) 실행 결과
년도 입력 : 2000
     3년    15년    27년    39년    51년    63년    75년    87년    99년   111년
   123년   135년   147년   159년   171년   183년   195년   207년   219년   231년
   243년   255년   267년   279년   291년   303년   315년   327년   339년   351년
   363년   375년   387년   399년   411년   423년   435년   447년   459년   471년
...
  1923년  1935년  1947년  1959년  1971년  1983년  1995년
서기 1년 ~ 2000년까지 돼지의 해는 167번 있음

*/

#include <stdio.h>

int main(void) {
    int year;

    printf("년도 입력 : ");
    fflush(stdout);
    if (scanf("%d", &year) != 1 || year < 1) {
        fprintf(stderr, "양수만 입력하세요.");
        return 1;
    }

    // pig 값을 할당해주지 않으면 쓰레기값으로 비교가 된다. 주의!!!!!!!!!!!!
    // while (pig < year) {    }
    int count = 0;
    for (int pig = 3; pig <= year; pig += 12) {
        printf("%6d년", pig);
        count++;
        if (count % 10 == 0) {
            printf("\n");
        }
    }
    if (count % 10 != 0) {
        printf("\n");
    }

    printf("\n");
    printf("서기 1년 ~ %d년까지 돼지의 해는 %d번 있음\n", year, count);

    return 0;
}
