/*
[문제6] 온도 변환하기
키보드로 화씨(°F)온도를 입력 받고 섭씨(°C)온도를 계산하여 출력하는 프로그램을 작성하시오.
출력되는 섭씨온도는 소수점 이하 첫째자리까지 출력하며 아래 주어진 공식을 사용할 것.
1)공식
C=5/9(F-32) // (C : 섭씨,  F : 화씨) 
2)실행
화씨 온도를 입력하세요 : 40
섭씨 온도는 4.4도입니다.

*/

#include <stdio.h>

int main(void)
{
  double c;
  double f;

  printf("화씨 온도를 입력하세요 : ");
  fflush(stdout);
  if (scanf("%lf", &f) != 1) {
    fprintf(stderr,"화씨 온도는 숫자만 입력 가능\n");
    return 1;
  } ;

  // 5 / 9 로만 계산하면 무조건 0 출력
  // 혹은 (f - 32) * 5 / 9 는 가능
  c = 5.0 / 9.0 * (f - 32.0);

  printf("섭씨 온도는 %.1f도입니다.\n", c);

  return 0;
}